In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.rand(3,3)*10
data = data.round()
data

array([[4., 4., 3.],
       [7., 5., 2.],
       [0., 6., 6.]])

In [4]:
pd.DataFrame(data)

     0    1    2
0  4.0  4.0  3.0
1  7.0  5.0  2.0
2  0.0  6.0  6.0

In [5]:
idx=["a","b","c"]
col=["x","y","z"]

In [6]:
tablo = pd.DataFrame(data, index=idx, columns=col)
tablo

     x    y    z
a  4.0  4.0  3.0
b  7.0  5.0  2.0
c  0.0  6.0  6.0

In [7]:
# reset_index() metodu 
tablo.reset_index()

  index    x    y    z
0     a  4.0  4.0  3.0
1     b  7.0  5.0  2.0
2     c  0.0  6.0  6.0

In [8]:
idx2 = ["AA","BB","CC"]

In [9]:
tablo["T"] = idx2
tablo

     x    y    z   T
a  4.0  4.0  3.0  AA
b  7.0  5.0  2.0  BB
c  0.0  6.0  6.0  CC

In [10]:
# set_index() metodu
tablo.set_index("T")

      x    y    z
T
AA  4.0  4.0  3.0
BB  7.0  5.0  2.0
CC  0.0  6.0  6.0

In [12]:
# loc,location'ın kısaltılmış hali, iloc ise index location'ının kısaltılmış halidir.

In [13]:
tablo

     x    y    z   T
a  4.0  4.0  3.0  AA
b  7.0  5.0  2.0  BB
c  0.0  6.0  6.0  CC

In [14]:
tablo = tablo.set_index("T")
tablo

      x    y    z
T
AA  4.0  4.0  3.0
BB  7.0  5.0  2.0
CC  0.0  6.0  6.0

In [17]:
tablo.loc["CC"]

x    0.0
y    6.0
z    6.0
Name: CC, dtype: float64

In [18]:
tablo.loc[["CC"]] # Yatay olarak döndürür.

      x    y    z
T
CC  0.0  6.0  6.0

In [19]:
tablo.iloc[1] # iloc'ta parametre yalnızca int türünde olmalıdır.

x    7.0
y    5.0
z    2.0
Name: BB, dtype: float64

In [20]:
tablo.iloc[[1]] # yatay olarak döndürür.

      x    y    z
T
BB  7.0  5.0  2.0

In [21]:
c = tablo.iloc[[1]] # bu metotları bu şekilde bir değişkene atarsak;
c # yalnızca bu satırı incelemek için kolaylık sağlar.

      x    y    z
T
BB  7.0  5.0  2.0